#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

terraform
module.cloudwatch_logs.aws_cloudwatch_log_group.logs: Refreshing state... [id=/machamp/staging/ecs]
module.ecs.aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:762742784206:cluster/machamp-staging-cluster]
module.ecr.aws_ecr_repository.ecr: Refreshing state... [id=machamp-repository]
module.network.aws_vpc.vpc: Refreshing state... [id=vpc-09d8ac12538411d38]
module.ecs.module.ecs_task_execution_role.aws_iam_role.iam_role: Refreshing state... [id=ecs-task-execution]
module.ecs.aws_ecs_task_definition.taskdef: Refreshing state... [id=staging]
module.ecs.module.ecs_task_execution_role.aws_iam_policy.default: Refreshing state... [id=arn:aws:iam::762742784206:policy/ecs-task-execution]
module.ecs.module.ecs_task_execution_role.aws_iam_role_policy_attachment.default: Refreshing state... [id=ecs-task-execution-20210530141349119800000001]
module.ecr.aws_ecr_lifecycle_policy.ecr_lifecycle: Refreshing state... [id=machamp-repository]
module.network.aws_route_table.public: Refreshing state... [id=rtb-01aa3ece37c6487e0]
module.network.aws_subnet.public["ap-northeast-1a"]: Refreshing state... [id=subnet-09fd540a6c087b413]
module.ecs_service_sg.aws_security_group.sg: Refreshing state... [id=sg-0765e9b21f27b9a87]
module.http_sg.aws_security_group.sg: Refreshing state... [id=sg-068c5d2fcd746ab57]
module.network.aws_subnet.public["ap-northeast-1c"]: Refreshing state... [id=subnet-078207bd7321b1695]
module.network.aws_subnet.private["ap-northeast-1c"]: Refreshing state... [id=subnet-04c459391a247e0ab]
module.network.aws_internet_gateway.igw: Refreshing state... [id=igw-0320d2046da4cfbfb]
module.network.aws_subnet.private["ap-northeast-1a"]: Refreshing state... [id=subnet-0f47b5557a518ee32]
module.https_sg.aws_security_group.sg: Refreshing state... [id=sg-09157ae42a7ec22ca]
module.ecs_service_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-133425637]
module.ecs_service_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-2445190106]
module.https_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-993995983]
module.https_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-1073499807]
module.http_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-4212506818]
module.http_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-1671588254]
module.network.aws_route_table_association.public["ap-northeast-1a"]: Refreshing state... [id=rtbassoc-095bf430a13fe6780]
module.network.aws_route_table_association.public["ap-northeast-1c"]: Refreshing state... [id=rtbassoc-0399fe76182b6078f]
module.network.aws_route.public: Refreshing state... [id=r-rtb-01aa3ece37c6487e01080289494]
module.alb.aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:loadbalancer/app/machamp-staging-alb/8a1895f7f9c91409]
module.alb.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:targetgroup/example/0ae2b131cf2341a9]
module.alb.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:listener/app/machamp-staging-alb/8a1895f7f9c91409/f1a4bee2a08032c5]
module.ecs.aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:762742784206:service/machamp-staging-cluster/machamp-staging-service]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.db_sg.aws_security_group.sg will be created
  + resource "aws_security_group" "sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "mysql-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "machamp-staging-mysql-sg"
        }
      + tags_all               = {
          + "Name" = "machamp-staging-mysql-sg"
        }
      + vpc_id                 = "vpc-09d8ac12538411d38"
    }

  # module.db_sg.aws_security_group_rule.egress will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.db_sg.aws_security_group_rule.ingress will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.rds.aws_db_instance.this will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = false
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_subnet_group_name                  = "machamp-staging-subnet-group"
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "8.0.20"
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "machamp-staging-db"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "t3.small"
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + name                                  = (known after apply)
      + option_group_name                     = "machamp-staging"
      + parameter_group_name                  = "machamp-staging"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 3306
      + publicly_accessible                   = false
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_type                          = "gp2"
      + tags_all                              = (known after apply)
      + timezone                              = (known after apply)
      + username                              = "admin"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.rds.aws_db_option_group.this will be created
  + resource "aws_db_option_group" "this" {
      + arn                      = (known after apply)
      + engine_name              = "mysql"
      + id                       = (known after apply)
      + major_engine_version     = "8.0.20"
      + name                     = "machamp-staging"
      + name_prefix              = (known after apply)
      + option_group_description = "machamp-staging option group"
      + tags_all                 = (known after apply)
    }

  # module.rds.aws_db_parameter_group.this will be created
  + resource "aws_db_parameter_group" "this" {
      + arn         = (known after apply)
      + description = "machamp-staging parameter group"
      + family      = "mysql8.0"
      + id          = (known after apply)
      + name        = "machamp-staging"
      + name_prefix = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.rds.aws_db_subnet_group.this will be created
  + resource "aws_db_subnet_group" "this" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "machamp-staging-subnet-group"
      + name_prefix = (known after apply)
      + subnet_ids  = [
          + "subnet-04c459391a247e0ab",
          + "subnet-0f47b5557a518ee32",
        ]
      + tags_all    = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

</details>